notes/week_1/day_2/drafts/2-performance_test_output.txt
Objective
Meet Service-Level Obectives

99% of requests should be successful
99% od requests should have latency of 1000s or less

Configuring Options with Thresholds and Scenarios

Th options object will contain the information for the test that the system will peform to goal criteria.

// Set the object oprtions
export const options = {
    // Define the thresshold
    thresholds: {
        http_req_failed : ['rate<0.01'],
        http_req_duration: ['p(99)<1000],
    },
    // define scenarios
    scenarios:{
        average_load:{
            executor: 'ramping-vus',
        stages: [
            {duration: '10s', target: 20},
            {duration: '50s', target: 20},
            {duration: '5s', target: 0},
        ],
        },
    },
};


-----

Test Result

     execution: local
        script: k6-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m35s max duration (incl. graceful stop):
              * average_load: Up to 20 looping VUs for 1m5s over 3 stages (gracefulRampDown: 30s, gracefulStop: 0s)



  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(99)<1000' p(99)=152.11ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8062    123.995062/s
    checks_succeeded...: 100.00% 8062 out of 8062
    checks_failed......: 0.00%   0 out of 8062

    ✓ response code was 200

    HTTP
    http_req_duration..............: avg=142.18ms min=140.03ms med=141.54ms max=597.04ms p(90)=143.32ms p(95)=14.6ms 
      { expected_response:true }...: avg=142.18ms min=140.03ms med=141.54ms max=597.04ms p(90)=143.32ms p(95)=14.6ms 
    http_req_failed................: 0.00%  0 out of 8062
    http_reqs......................: 8062   123.995062/s

    EXECUTION
    iteration_duration.............: avg=143.09ms min=140.14ms med=141.72ms max=597.19ms p(90)=143.5ms  p(95)=14.82ms
    iterations.....................: 8062   123.995062/s
    vus............................: 1      min=1         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 3.9 MB 61 kB/s
    data_sent......................: 948 kB 15 kB/s



running (1m05.0s), 00/20 VUs, 8062 complete and 0 interrupted iterations
average_load ✓ [======================================] 00/20 VUs  1m5s